app/controllers/caves_controller.rb

SELECT "caves".* FROM "caves"
---
  def index
    @caves = Cave.all